name: "CaffeNet"
layer {
  name: "pair_data"
  top: "data"
  top: "sim" 
  type: "WindowData"
  window_data_param {
    source: "./test/window_file_voc_2007_trainval.txt"    
    batch_size: 128        
    fg_threshold: 0.5
    bg_threshold: 0.5
    fg_fraction: 0.5
    context_pad: 16
    crop_mode: "warp"
  } 
  transform_param {
    crop_size: 227
    mirror: true
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
  }

}
layer {
  name: "slice_pair"
  type: "Slice"
  bottom: "data"
  top: "data_a"
  top: "data_b"
  slice_param {
    slice_dim: 1
    slice_point: 3
  }
}
layer {
  name: "conv1_a"
  bottom: "data_a"
  top: "conv1_a"  
  type: "Convolution"
  param { name: "conv1_weight" decay_mult: 1 lr_mult: 1}
  param { name: "conv1_bias" lr_mult: 2 decay_mult: 0}
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_a"
  bottom: "conv1_a"
  top: "conv1_a"
  type: "ReLU"
}
layer {
  name: "pool1_a"
  bottom: "conv1_a"
  top: "pool1_a"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_a"
  bottom: "pool1_a"
  top: "norm1_a"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2_a"
  bottom: "norm1_a"
  top: "conv2_a"
  type: "Convolution"
  param {
    name: "conv2_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv2_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_a"
  bottom: "conv2_a"
  top: "conv2_a"
  type: "ReLU"
}
layer {
  name: "pool2_a"
  bottom: "conv2_a"
  top: "pool2_a"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2    
  }
}
layer {
  name: "norm2_a"
  bottom: "pool2_a"
  top: "norm2_a"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3_a"
  bottom: "norm2_a"
  top: "conv3_a"
  type: "Convolution"
  param {
    name: "conv3_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv3_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_a"
  bottom: "conv3_a"
  top: "conv3_a"
  type: "ReLU"
}
layer {
  name: "conv4_a"
  bottom: "conv3_a"
  top: "conv4_a"
  type: "Convolution"
  param {
    name: "conv4_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv4_bias"
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
   name: "relu4_a"  
   bottom: "conv4_a"
   top: "conv4_a"
   type: "ReLU"
}
layer {
  name: "conv5_a"
  bottom: "conv4_a"
  top: "conv5_a"
  type: "Convolution"
  param {
    name: "conv5_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv5_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5_a"
  bottom: "conv5_a"
  top: "conv5_a"  
  type: "ReLU"
}
layer {
  name: "pool5_a"
  bottom: "conv5_a"
  top: "pool5_a"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6_a"
  bottom: "pool5_a"
  top: "fc6_a"
  type: "InnerProduct"
  param {
    name: "fc6_weight"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_bias"
    lr_mult: 2
     decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6_a"  
  bottom: "fc6_a"
  top: "fc6_a"  
  type: "ReLU"
}
layer {
  name: "drop6_a" 
  bottom: "fc6_a"
  top: "fc6_a"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_a"
  bottom: "fc6_a"
  top: "fc7_a"
  type: "InnerProduct"
  param {
    name: "fc7_weight"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_bias"
    lr_mult: 2
     decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}

layer {
  name: "conv1_b"
  bottom: "data_b"
  top: "conv1_b"  
  type: "Convolution"
  param {
    name: "conv1_weight"
    decay_mult: 1
    lr_mult: 1
  }
  param {
    name: "conv1_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_b"
  bottom: "conv1_b"
  top: "conv1_b"
  type: "ReLU"
}
layer {
  name: "pool1_b"
  bottom: "conv1_b"
  top: "pool1_b"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_b"
  bottom: "pool1_b"
  top: "norm1_b"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2_b"
  bottom: "norm1_b"
  top: "conv2_b"
  type: "Convolution"
  param {
    name: "conv2_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv2_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_b"
  bottom: "conv2_b"
  top: "conv2_b"
  type: "ReLU"
}
layer {
  name: "pool2_b"
  bottom: "conv2_b"
  top: "pool2_b"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2_b"
  bottom: "pool2_b"
  top: "norm2_b"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3_b"
  bottom: "norm2_b"
  top: "conv3_b"
  type: "Convolution"
  param {
    name: "conv3_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv3_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_b"
  bottom: "conv3_b"
  top: "conv3_b"
  type: "ReLU"
}
layer {
  name: "conv4_b"
  bottom: "conv3_b"
  top: "conv4_b"
  type: "Convolution"
  param {
    name: "conv4_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv4_bias"
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
   name: "relu4_b"  
   bottom: "conv4_b"
   top: "conv4_b"
   type: "ReLU"
}
layer {
  name: "conv5_b"
  bottom: "conv4_b"
  top: "conv5_b"
  type: "Convolution"
  param {
    name: "conv5_weight"
    lr_mult: 1
    decay_mult: 1    
  }
  param {
    name: "conv5_bias"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  bottom: "conv5_b"
  top: "conv5_b"
  name: "relu5_b"
  type: "ReLU"
}
layer {
  name: "pool5_b"
  bottom: "conv5_b"
  top: "pool5_b"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2    
  }
}
layer {
  name: "fc6_b"
  bottom: "pool5_b"
  top: "fc6_b"
  type: "InnerProduct"
  param {
    name: "fc6_weight"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_bias"
    lr_mult: 2
     decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6_b"  
  bottom: "fc6_b"
  top: "fc6_b"  
  type: "ReLU"
}
layer {
  name: "drop6_b" 
  bottom: "fc6_b"
  top: "fc6_b"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_b"
  bottom: "fc6_b"
  top: "fc7_b"
  type: "InnerProduct"
  param {
    name: "fc7_weight"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_bias"
    lr_mult: 2
     decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "loss"
  type: "ContrastiveLoss"
  bottom: "fc7_a"
  bottom: "fc7_b"
  bottom: "sim"
  top: "loss"
  contrastive_loss_param {
    margin: 1
  }
}
